erp3l/src/Catalogs/ШаблоныМероприятий/ШаблоныМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныМероприятий</name>
  <predefined>
    <items>
      <name>ЗакупочнаяПроцедура_АукционМСП</name>
      <description>Шаблон Закупочная процедура (аукцион в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_Аукцион</name>
      <description>Шаблон Закупочная процедура (аукцион)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗакупкаУЕдинственногоПоставщика</name>
      <description>Шаблон Закупочная процедура (закупка у единственного поставщика)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросКотировокМСП</name>
      <description>Шаблон Закупочная процедура (запрос котировок в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросКотировок</name>
      <description>Шаблон Закупочная процедура (запрос котировок)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросПредложенийМСП</name>
      <description>Шаблон Закупочная процедура (запрос предложений в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросПредложений</name>
      <description>Шаблон Закупочная процедура (запрос предложений)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_КвалификационныйОтбор</name>
      <description>Шаблон Закупочная процедура (квалификационный отбор)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_КонкурентныеПереговоры</name>
      <description>Шаблон Закупочная процедура (конкурентные переговоры)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_КонкурсМСП</name>
      <description>Шаблон Закупочная процедура (конкурс в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_Конкурс</name>
      <description>Шаблон Закупочная процедура (конкурс)</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроцентВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКонтрольЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПоследовательностьСтадий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрольнойПроцедуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыявленияРисков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяСистема</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитываетсяВНалоговомМониторинге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяЗаписьРезультатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Стадии</name>
    <attributes>
      <name>Стадия</name>
      <type>
        <types>CatalogRef.СтадииМероприятий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующаяСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеГруппы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеМинимальнойДлительности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеМаксимальнойДлительности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Enums/ВидыМероприятий/ВидыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятий</name>
  <enumValues>
    <name>КонтрольноеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>Инициатива</name>
  </enumValues>
  <enumValues>
    <name>РеакцияНаРиск</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочнаяПроцедура</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ШаблоныМероприятий/ObjectModule.bsl
// Осуществляет проверку наличия обязательных стадий для шаблона мероприятия
// по закупочной процедуре. Возвращает успешность проверки.
Функция ПроверитьНаличиеОбязательныхСтадийЗакупочнойПроцедуры()
	РезультатФункции = Истина;
	Если ВидМероприятия = Перечисления.ВидыМероприятий.ЗакупочнаяПроцедура Тогда
		МассивОфициальноеОбъявлениеЗакупки		 = Справочники.СтадииМероприятий.ВернутьСтадииОфициальноеОбъявлениеЗакупки();
		МассивНачалоПодготовкиЗакупки			 = Справочники.СтадииМероприятий.ВернутьСтадииНачалоПодготовкиЗакупкиКПубликации();
		НайденоОфициальноеОбъявлениеЗакупки	 = Ложь;
		НайденоНачалоПодготовкиЗакупки		 = Ложь;
		Для Каждого ТекСтадии Из Стадии Цикл
			Если МассивОфициальноеОбъявлениеЗакупки.Найти(ТекСтадии.Стадия) <> Неопределено Тогда
				НайденоОфициальноеОбъявлениеЗакупки = Истина;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли;
			Если МассивНачалоПодготовкиЗакупки.Найти(ТекСтадии.Стадия) <> Неопределено Тогда
				НайденоНачалоПодготовкиЗакупки = Истина;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли;
		КонецЦикла;	
		Если Не НайденоОфициальноеОбъявлениеЗакупки Тогда
			ТекстСообщения = НСтр("ru = 'В шаблоне %Шаблон% не найдена стадия официального объявления закупки. Запись отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Шаблон%", Строка(Наименование));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РезультатФункции = Ложь;
		Иначе
			// Проверка стадии официального объявления закупки пройдена.
		КонецЕсли;
		Если Не НайденоНачалоПодготовкиЗакупки Тогда
			ТекстСообщения = НСтр("ru = 'В шаблоне %Шаблон% не найдена стадия начала подготовки закупки к публикации. Запись отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Шаблон%", Строка(Наименование));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РезультатФункции = Ложь;
		Иначе
			// Проверка стадии начала подготовки закупки к публикации пройдена.
		КонецЕсли;
	Иначе
		// Для прочих видов операций не осуществляем проверку.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПроверитьНаличиеОбязательныхСтадий();	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	// Проверка заполнения способа выбора поставщика для закупочной процедуры.
	Если ВидМероприятия = Перечисления.ВидыМероприятий.ЗакупочнаяПроцедура Тогда
		Если НЕ ЗначениеЗаполнено(СпособВыбораПоставщика) Тогда
			ТекстСообщения = НСтр("ru = 'В шаблоне мероприятий %Шаблон% требуется заполнить поле ""Способ выбора поставщика"". Запись отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Шаблон%", Строка(Ссылка));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			Отказ = Истина;
		Иначе
			// Проверка пройдена успешно.
		КонецЕсли;	
	Иначе
		// Не выполняем проверку способа выбора поставщика для прочих видов мероприятий.
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	// Снятие флажков ИспользоватьПроцентВыполнения и ИспользоватьКонтрольЗатрат, т.к. данный функционал не задействован в закупках.
	Если ВидМероприятия = Перечисления.ВидыМероприятий.ЗакупочнаяПроцедура Тогда
		ИспользоватьКонтрольЗатрат = Ложь;
		ИспользоватьПроцентВыполнения = Ложь;
	Иначе
		// Не изменяем флажки.
	КонецЕсли;
	// Проверка наличия обязательных стадий закупочных процедур.
	РезультатПроверкиОбязательныхСтадий = ПроверитьНаличиеОбязательныхСтадийЗакупочнойПроцедуры();
	Если Не РезультатПроверкиОбязательныхСтадий Тогда
		Отказ = Истина;
	Иначе
		// Проверка пройдена успешно.
	КонецЕсли;	
	// Проверка наличия стадии со 100 прогресса.
	Если ИспользоватьПроцентВыполнения Тогда
		МаксПрогресс = 0;
		Для Каждого ТекСтадии Из Стадии Цикл
			Если ТекСтадии.ИтогВыполнения > МаксПрогресс Тогда
				МаксПрогресс = ТекСтадии.ИтогВыполнения;
			Иначе
				// Выполняем далее.
			КонецЕсли; 
		КонецЦикла;	
		Если МаксПрогресс <> 100 Тогда
			ТекстСообщения = НСтр("ru = 'В шаблоне мероприятий %Шаблон% требуется указать максимальную стадию с прогрессом 100. Запись отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Шаблон%", Строка(Ссылка));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			Отказ = Истина;
		Иначе
			// Проверка пройдена успешно.
		КонецЕсли;
	Иначе
		// Процент выполнения не используется. Не проверяем колонку.
	КонецЕсли;
КонецПроцедуры
